app/views/carts/show.html.erb

<table>
  <% @cart.lineitems.each do |item|%>
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 12]]