app/controllers/access_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def create
    user = User.find_by(name: params[:name])

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def authorize
        unless User.find_by_id(session[:user_id])