app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
def authorize
    unless User.find_by(id: session[:user_id])