app/controllers/current_cart.rb

  def set_cart
    @cart = Cart.find(session[:cart_id])
rescue ActiveRecord::RecordNotFound
      @cart = Cart.create()
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-06-15 22:17:38.605852"], ["updated_at", "2018-06-15 22:17:38.605852"]]