app/controllers/lineitems_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 306], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-06-10 23:15:46.105447"], ["updated_at", "2018-06-10 23:15:46.105447"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 306], ["cart_id", 15], ["created_at", "2018-06-14 22:08:29.964436"], ["updated_at", "2018-06-14 22:08:29.964436"]]
UPDATE "lineitems" SET "quantity" = ?, "updated_at" = ? WHERE "lineitems"."id" = ?  [["quantity", 2], ["updated_at", "2018-06-14 22:08:34.175825"], ["id", 6]]
---
  def create
      #@lineitem = Lineitem.new(lineitem_params)

      product = Product.find(params[:product_id])
      @line_item = @cart.add_item(product.id)

    respond_to do |format|
      if @line_item.save