app/controllers/orders_controller.rb

  def new
      if @cart.lineitems.empty?
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 19]]
SELECT  1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 17], ["LIMIT", 1]]

  def create
      @order = Order.new(order_params)
      @order.add_items_from_cart(@cart)
    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-06-15 22:17:38.605852"], ["updated_at", "2018-06-15 22:17:38.605852"]]
INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "name1"], ["address", "123"], ["email", "321"], ["paytype", "Check"], ["created_at", "2018-06-15 22:17:02.322976"], ["updated_at", "2018-06-15 22:17:02.322976"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 19]]