app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "image", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ruby on Rails"], ["description", "Textbook "], ["image", "ruby.jpg"], ["price", 99.99], ["created_at", "2018-06-09 17:53:48.176832"], ["updated_at", "2018-06-09 17:53:48.176832"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save