app/controllers/shopper_controller.rb

SELECT "products".* FROM "products" WHERE (cast(price as real) == 8.99) ORDER BY name
---
  def index
    if params[:field] == nil
      @products = Product.order(:name)